# System tools
brew "chezmoi"
brew "fzf"
brew "fish"
brew "fisher"
brew "neovim"
brew "lazygit"
brew "direnv"
brew "ripgrep"
brew "fd"
brew "eza"
brew "bat"
brew "tldr"
brew "git-delta"
brew "difftastic"
brew "dust"
brew "the_silver_searcher"
brew "tree"
brew "wget"
brew "watch"
brew "telnet"
brew "hugo"
brew "yq"
brew "jq"
brew "jless"

# Languages
brew "python"
brew "poetry"
brew "go"
brew "gofumpt"
brew "gopls"
brew "lua"
brew "luarocks"
brew "lua-language-server"
brew "yaml-language-server"

# Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"

# Desktop apps
cask "wezterm"
cask "visual-studio-code"
cask "rectangle"
cask "discord"
cask "google-chrome"
cask "1password"
cask "1password-cli"
cask "vlc"
cask "obs"
